## Pandas for Data Analysis

In [2]:
import numpy as np
import pandas as pd

In [4]:
user_data = {
    "MarksA": np.random.randint(1,100,5),
    "MarksB": np.random.randint(50,100,5),
    "MarksC": np.random.randint(1,100,5)
}

In [5]:
df = pd.DataFrame(user_data)

In [6]:
df

   MarksA  MarksB  MarksC
0      13      77      13
1      81      62      71
2      87      56      58
3      94      74      25
4      93      83      79

In [7]:
df.head(3)

   MarksA  MarksB  MarksC
0      13      77      13
1      81      62      71
2      87      56      58

In [18]:
df.tail(2)

   MarksA  MarksB  MarksC
3      94      74      25
4      93      83      79

In [8]:
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [9]:
df.to_csv("marks.csv")

In [11]:
my_data = pd.read_csv("marks.csv")

In [12]:
my_data

   Unnamed: 0  MarksA  MarksB  MarksC
0           0      13      77      13
1           1      81      62      71
2           2      87      56      58
3           3      94      74      25
4           4      93      83      79

In [15]:
my_data = my_data.drop(columns=["Unnamed: 0"])

In [17]:
my_data.describe()

          MarksA     MarksB     MarksC
count   5.000000   5.000000   5.000000
mean   73.600000  70.400000  49.200000
std    34.275356  11.104053  28.882521
min    13.000000  56.000000  13.000000
25%    81.000000  62.000000  25.000000
50%    87.000000  74.000000  58.000000
75%    93.000000  77.000000  71.000000
max    94.000000  83.000000  79.000000

In [19]:
# Row

df.iloc[2]

MarksA    87
MarksB    56
MarksC    58
Name: 2, dtype: int64

In [21]:
df.iloc[2][1]

56

In [22]:
#Sort
my_data.sort_values(by=["MarksA"])

   MarksA  MarksB  MarksC
0      13      77      13
1      81      62      71
2      87      56      58
4      93      83      79
3      94      74      25

In [24]:
my_data.sort_values(by=["MarksA"],ascending=False)

   MarksA  MarksB  MarksC
3      94      74      25
4      93      83      79
2      87      56      58
1      81      62      71
0      13      77      13

In [28]:
#returns a numpy array
my_data.values

array([[13, 77, 13],
       [81, 62, 71],
       [87, 56, 58],
       [94, 74, 25],
       [93, 83, 79]])